# Introduction to pandas dataframe
- used to represent data in rows and col<br>
- it is a data structure used to represent data in tabular or excel format

In [2]:
# creating data frame

import pandas as pd

df = pd.read_csv('weatherData.csv')
df

      Year  Month  Day  Hour  ...  SunriseHour SunriseMin  SunsetHour SunsetMin
0     2017      9   16     0  ...            5         37          18         4
1     2017      9   16     1  ...            5         37          18         4
2     2017      9   16     2  ...            5         37          18         4
3     2017      9   16     3  ...            5         37          18         4
4     2017      9   16     4  ...            5         37          18         4
...    ...    ...  ...   ...  ...          ...        ...         ...       ...
8753  2018      9   15    19  ...            5         37          18         4
8754  2018      9   15    20  ...            5         37          18         4
8755  2018      9   15    21  ...            5         37          18         4
8756  2018      9   15    22  ...            5         37          18         4
8757  2018      9   15    23  ...            5         37          18         4

[8758 rows x 13 columns]

In [4]:
# creating dataset .... list of tuples

wheather_data = [('1/1/24' , 32 , 6 , 'Rain'),
                ('1/2/24' , 35 , 3 , 'Sunny'),
                ('1/3/24' , 38 , 5 , 'Snow'),
                ('1/4/24' , 39 , 7 , 'Rain'),
                ('1/5/24' , 37 , 9 , 'Sunny')]
df = pd.DataFrame(wheather_data , columns = ['Date' , 'Temperature' , 'Windspeed' , 'Climate'])
df

     Date  Temperature  Windspeed Climate
0  1/1/24           32          6    Rain
1  1/2/24           35          3   Sunny
2  1/3/24           38          5    Snow
3  1/4/24           39          7    Rain
4  1/5/24           37          9   Sunny

In [5]:
# get the dimension of the table

df.shape

(5, 4)

In [7]:
# print first 2

df.head(2)

     Date  Temperature  Windspeed Climate
0  1/1/24           32          6    Rain
1  1/2/24           35          3   Sunny

In [9]:
# to display last few rows

df.tail(2)

     Date  Temperature  Windspeed Climate
3  1/4/24           39          7    Rain
4  1/5/24           37          9   Sunny

In [10]:
# slicing 

df[2:5]

     Date  Temperature  Windspeed Climate
2  1/3/24           38          5    Snow
3  1/4/24           39          7    Rain
4  1/5/24           37          9   Sunny

In [11]:
df.columns   # print columns in a table

Index(['Date', 'Temperature', 'Windspeed', 'Climate'], dtype='object')

In [13]:
df.Date  # display columns in a table

0    1/1/24
1    1/2/24
2    1/3/24
3    1/4/24
4    1/5/24
Name: Date, dtype: object

In [14]:
# another method

df['Date']

0    1/1/24
1    1/2/24
2    1/3/24
3    1/4/24
4    1/5/24
Name: Date, dtype: object

In [17]:
# to access 2 columns

df[['Date' , 'Climate']]

     Date Climate
0  1/1/24    Rain
1  1/2/24   Sunny
2  1/3/24    Snow
3  1/4/24    Rain
4  1/5/24   Sunny

In [18]:
# to find max of the Windspeed

df['Windspeed'].max()

9

In [19]:
df['Temperature'].describe()

count     5.000000
mean     36.200000
std       2.774887
min      32.000000
25%      35.000000
50%      37.000000
75%      38.000000
max      39.000000
Name: Temperature, dtype: float64

In [20]:
# selecting row which has maximum temperature

df[df.Temperature == df.Temperature.max()]

     Date  Temperature  Windspeed Climate
3  1/4/24           39          7    Rain

In [21]:
# selecting date which has maximum temperature

df.Date[df.Temperature == df.Temperature.max()]

3    1/4/24
Name: Date, dtype: object